####____2____####

# Задано чотирицифрове натуральне число.

a = int(input('Введіть чотиризначне число: '))

# Знайти добуток цифр цього числа
# a

a1 = a // 1000
a2 = a // 100 % 10
a3 = a // 10 % 100 % 10
a4 = a % 10
print('Перша цифра числа: ', a1)
print('Друга цифра числа: ', a2)
print('Третя цифра числа: ', a3)
print('Четверта цифра числа: ', a4)
print('Добуток цифр вашого числа: ', a1 + a2 + a3 + a4)
print()

# b

b = input('Введіть чотиризначне число: ')
b = str(b)
print('Сума цифр вашого числа: ',
      (int(b[0]) + int(b[1]) + int(b[2]) + int(b[3])))
print()

# Записати число в реверсному порядку
# a

c = input('Введіть чотиризначне число: ')
c = list(c)
c1 ="".join(c[::-1])
print("Ваше число в реверсному порядку: ", c1)
print()

# b

d = input('Введіть чотиризначне число: ')
d = str(d)
d1 = (int(d[3]) * 1000 + int(d[2]) * 100 + int(d[1]) * 10 + int(d[0]))
print('Число в реверсному порядку: ', d1)
print()

# Посортувати цифри, що входять в дане число

z = input('Введіть чотиризначне число: ')
z = list(str(z))
print('Цифри вашого числа в порядку зростання: ', sorted(z))
